//
// Created by Administrator on 2019/3/30.
//
#include <stdio.h>
void demo1()
{
    //2个字节=16位 有效位数15位 32 768
//    short a = - 32768;
//    short b = 32768;
//
//    unsigned short c = 65535;
//
//    printf("%hd,%hd,%hu\n",a,b,c);
//    printf("%hd,%hd,%hd\n", sizeof(a), sizeof(b), sizeof(c));
//
//    short d = 0b00101010;
//    short e = 010;
//    short f = 0xef;
//
//    printf("%#hx,%#hx,%#hx\n",d,e,f);
//
//    short d1 = 0b10101010;
//    printf("%#hx\n",d+d1);


      short a = 0x11;//有符号数  最高位为1表示负数
      //0x11 1000 0000 0001 0001 17
      //     1000 0000 0001 0001 原码
      //
      //

      printf("%hd\n",a);//以有符号形式输出【按短整形十进制输出】


      printf("%hu\n",a);//以无符号形式输出【按短整形十进制输出】

      short b = -0x11;//有符号数  最高位为1
      //-0x11 1000 0000 0001 0001
      //      1111 1111 1110 1110 反码
      //      1111 1111 1110 1111 补码

      //      ff ef

      printf("%#hX\n",b);//输出有符号数的十六进制


      short c = -9;//有符号的短整型
      //1000 0000 0000 1001 负数的原码
      //1111 1111 1111 0110 负数的反码
      //1111 1111 1111 0111 负数的补码

      //fff7

      printf("%#hX\n",c);//以十六进制输出
      printf("%hd\n",c);//以十进制输出


}

/**
 * 进制的各种问题
 */
void demo2()
{

    short a1 = 0b01;
    short a2 = 0b10;
    /***
     * 0000 0000 0000 0001
     * 0000 0000 0000 0010
     * 0000 0000 0000 0011
     * 0003
     */
    printf("%#hx\n",a1+a2);

    short b1 = 0b111;
    short b2 = 0b111;
    /**
     * 0000 0000 0000 0111
     * 0000 0000 0000 0111
     * 0000 0000 0000 1110
     * 000e
     */
     printf("%#hX\n",b1+b2);


     short c1 = 0b0101;
     short c2 = 0b1010;

     /**
      * 0101
      * 1010
      * 0000 0000 0000 0001
      * 1111 1111 1111 1111
      */

     printf("%#hX\n",c1-c2);


     short d1 = 0b01011010;
     short d2 = 0345;
     short d3 = 0xafe;

     /**
      * 01011010
      * 2*6 2*4 2*3 2 = 2+8+16+64=90
      *
      * 3*8[2] + 4*8[1] + 5*8 = 5+32+195 = 232
      *
      * 10*16[2]+15*16[1]+14 = 14+2560+240 = 2814
      */

     printf("d1=%hd,d2=%hd,d3=%hd\n",d1,d2,d3);



     short e2 = 0234;
     short e3 = 0xaf;
     /**
      * 2*8[2]+3*8[1]+4   + 5*8[-1]=5/8 +4*8[-2]=4/64 + 2*8[-3]=2/512
      * 128+28=156.  0.625+0.0625+0.00390625 = 156.69140625
      *
      *
      *
      * 10*16[1]+15*1 =160+15=175 + 2*16[-1]=2/16 + 3*16[-2]=3/256 + 1*16[3]=1/4096
      * 175 0.125+0.01171875+0.0024449878
      * 175.1391637378
      */



     printf("e2=%hd,e3=%hd\n",e2,e3);

     short f1 = 100;
     /**
      * 100
      * 0110 0100 64
      *
      * 144
      */


     printf("f1=%#ho,f1=%#hx\n",f1,f1);

     short g1 = 0b10100001;
     /**
      * 241
      * a1
      *
      */

     printf("g1=%#ho,g1=%#hX\n",g1,g1);


}