//
// Created by Administrator on 2019/3/30.
//
#include <stdio.h>
void demo1()
{
    //2个字节=16位 有效位数15位 32 768
//    short a = - 32768;
//    short b = 32768;
//
//    unsigned short c = 65535;
//
//    printf("%hd,%hd,%hu\n",a,b,c);
//    printf("%hd,%hd,%hd\n", sizeof(a), sizeof(b), sizeof(c));
//
//    short d = 0b00101010;
//    short e = 010;
//    short f = 0xef;
//
//    printf("%#hx,%#hx,%#hx\n",d,e,f);
//
//    short d1 = 0b10101010;
//    printf("%#hx\n",d+d1);


      short a = 0x11;//有符号数  最高位为1表示负数
      //0x11 1000 0000 0001 0001 17
      //     1000 0000 0001 0001 原码
      //
      //

      printf("%hd\n",a);//以有符号形式输出【按短整形十进制输出】


      printf("%hu\n",a);//以无符号形式输出【按短整形十进制输出】

      short b = -0x11;//有符号数  最高位为1
      //-0x11 1000 0000 0001 0001
      //      1111 1111 1110 1110 反码
      //      1111 1111 1110 1111 补码

      //      ff ef

      printf("%#hX\n",b);//输出有符号数的十六进制


      short c = -9;//有符号的短整型
      //1000 0000 0000 1001 负数的原码
      //1111 1111 1111 0110 负数的反码
      //1111 1111 1111 0111 负数的补码

      //fff7

      printf("%#hX\n",c);//以十六进制输出
      printf("%hd\n",c);//以十进制输出


}

/**
 * 进制的各种问题
 */
void demo2()
{

    short a1 = 0b01;
    short a2 = 0b10;
    /***
     * 0000 0000 0000 0001
     * 0000 0000 0000 0010
     * 0000 0000 0000 0011
     * 0003
     */
    printf("%#hx\n",a1+a2);

    short b1 = 0b111;
    short b2 = 0b111;
    /**
     * 0000 0000 0000 0111
     * 0000 0000 0000 0111
     * 0000 0000 0000 1110
     * 000e
     */
     printf("%#hX\n",b1+b2);


     short c1 = 0b0101;
     short c2 = 0b1010;

     /**
      * 0101
      * 1010
      * 0000 0000 0000 0001
      * 1111 1111 1111 1111
      */

     printf("%#hX\n",c1-c2);


     short d1 = 0b01011010;
     short d2 = 0345;
     short d3 = 0xafe;

     /**
      * 01011010
      * 2*6 2*4 2*3 2 = 2+8+16+64=90
      *
      * 3*8[2] + 4*8[1] + 5*8 = 5+32+195 = 232
      *
      * 10*16[2]+15*16[1]+14 = 14+2560+240 = 2814
      */

     printf("d1=%hd,d2=%hd,d3=%hd\n",d1,d2,d3);



     short e2 = 0234;
     short e3 = 0xaf;
     /**
      * 2*8[2]+3*8[1]+4   + 5*8[-1]=5/8 +4*8[-2]=4/64 + 2*8[-3]=2/512
      * 128+28=156.  0.625+0.0625+0.00390625 = 156.69140625
      *
      *
      *
      * 10*16[1]+15*1 =160+15=175 + 2*16[-1]=2/16 + 3*16[-2]=3/256 + 1*16[3]=1/4096
      * 175 0.125+0.01171875+0.0024449878
      * 175.1391637378
      */



     printf("e2=%hd,e3=%hd\n",e2,e3);

     short f1 = 100;
     /**
      * 100
      * 0110 0100 64
      *
      * 144
      */


     printf("f1=%#ho,f1=%#hx\n",f1,f1);

     short g1 = 0b10100001;
     /**
      * 241
      * a1
      *
      */

     printf("g1=%#ho,g1=%#hX\n",g1,g1);


}

void demo3()
{
    short a = 9;
    short b = 5;

    /***
     * 计算机在计算加减时全部按加法处理
     * 9-5 = 9+(-5) 的二进制计算原理
     *0000 0000 0000 1001 正数【原码，反码，补码一样】 9
     *1000 0000 0000 0101 负数【原码】
     *1111 1111 1111 1010 负数【反码】
     *1111 1111 1111 1011 负数【补码】
     *
     *0000 0000 0000 1001 补码 9
     *1111 1111 1111 1011 补码 -5
     *   1 0000  0000  0000 0100 补码 多了1
     *   0000 0000 0000 0100 补码【正数】
     *   0000 0000 0000 0100 反码
     *   0000 0000 0000 0100 原码
     */

    printf("%#hX\n",a-b);
    short c = 5;
    short d = 19;

    /**
     * 5-19  5+(-19)的计算原理
     * 0000 0000 0000 0101 5的补码
     * 1000 0000 0001 0011 19的原码
     * 1111 1111 1110 1100 反码
     * 1111 1111 1110 1101 补码
     *
     * 0000 0000 0000 0101
     * 1111 1111 1110 1101
     * 1111  1111  1111  0010 补码【内存只保存补码】
     * fff2
     * 1111 1111 1111 0001 反码
     * 1000 0000 0000 1110 原码 结果
     *
     *得出结论：计算机存储正数和负数全以补码形式保存
     */
    printf("%#hX\n",c-d);
    short e = -0x1;
    /**
     * 1000 0000 0000 0001 原码
     * 1111 1111 1111 1110 反码
     * 1111 1111 1111 1111 补码
     * ffff
     */

    printf("%#hX\n",e);

}

void demo4()
{
    float a = 1.0012;
    float b = 0.8e10;//0.8*10的10次方
    float c = 0.92E-1;//0.92*10的-1次方
    double d = 0.23e10;//0.23*10的10次方

    printf("%f\n",a);
    printf("b=%e,b=%f\n",b,b);
    printf("c=%e,c=%f\n",c,c);
    printf("d=%lf,d=%le\n",d,d);
}

void demo5()
{
    char a = 'a';
    char b = 'b';
    putchar(a);
    putchar(b);
    printf("a=%c,b=%c\n",a,b);

    printf("a=%#hX\n",a);

    int c = 65;
    char d = 'q';
    printf("%c,%d,%x\n",c,c,c);
    printf("%c,%d,%x\n",d,d,d);
}